#+title: Miscellaneous utility functions for Elvish
#+author: Diego Zamboni
#+email: diego@zzamboni.org

#+name: module-summary
Various utility functions.

This file is written in [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][literate programming style]], to make it easy to explain. See [[file:util.elv][util.elv]] for the generated file.

** Dotifying strings

=util:dotify-string= shortens a string to a maximum length, followed by dots.

#+begin_src elvish :use github.com/zzamboni/elvish-modules/util :exports both
  util:dotify-string somelongstring 5
#+end_src

#+results:
: ▶ somel…

** Parallel redirection of stdout/stderr to different commands

=util:pipesplit= does parallel redirection of stdout and stderr to different commands. It takes three lambdas: The first one is executed, its stdout is redirected to the second one, and its stderr to the third one.

#+begin_src elvish :use github.com/zzamboni/elvish-modules/util :exports both
  util:pipesplit { echo stdout-test; echo stderr-test >&2 } { echo STDOUT: (cat) } { echo STDERR: (cat) }
#+end_src

#+results:
: STDOUT: stdout-test
: STDERR: stderr-test

** Evaluating code

=util:eval= does dynamic evaluation of code. Note that due to Elvish's scoping rules, statements are evaluated within the context of the =util= module, so variable assignments will not be persistent. Also, if you need to make use of any modules within the code, you need to explicitly load them with =use=.

#+begin_src elvish :exports both :use github.com/zzamboni/elvish-modules/util
  util:eval "put foo"
#+end_src

#+results:
: ▶ foo

** Reading a line of input

=util:readline= reads a line from the current input pipe, until the first end of line. Depending on the version of Elvish you have, it either uses an external command, or an internal function, but the result is the same.

#+begin_src elvish :exports both :use github.com/zzamboni/elvish-modules/util
  echo "hi there\nhow are you" | util:readline
#+end_src

#+RESULTS:
: ▶ 'hi there'

=util:readline= can take some optional arguments:

- =&eol=: the end-of-line character to use (defaults to newline). This argument is only fully functional in newer versions of Elvish (after 0.13), which have the =read-upto= function.
- =&nostrip=: whether to strip the EOL character from the end of the string. Defaults to =$false=, which means the EOL character is stripped.
- =&prompt=: optional prompt to print before reading the input. If a prompt is specified, then input/output is forced from the terminal (=/dev/tty=) instead of the input pipe, since the existence of a prompt presumes interactive use.

#+begin_src elvish :exports both :use github.com/zzamboni/elvish-modules/util
echo "hi there\nhow are you" | util:readline &nostrip
echo "hi there.how are you" | util:readline &eol=.
echo "hi there.how are you" | util:readline &eol=. &nostrip
#+end_src

#+RESULTS:
: ▶ "hi there\n"
: ▶ 'hi there'
: ▶ 'hi there.'

** Maximum/minimum

Return the maximum/minimum in a list of numbers. If the =&with= option is provided, it must be a function which receives on argument and returns a number, which is used for the comparison instead of the actual values. In this case, the list elements can be anything, as long as the =&with= function returns a numeric value.

#+begin_src elvish :exports both :use github.com/zzamboni/elvish-modules/util
  util:max 3 4 5 2 -1 4 0
  util:min 3 4 5 2 -1 4 0
  util:max a bc def ghijkl &with=$count~
  util:min a bc def ghijkl &with=$count~
#+end_src

#+results:
: ▶ 5
: ▶ -1
: ▶ ghijkl
: ▶ a

** Conditionals

=util:cond= emulates [[https://clojuredocs.org/clojure.core/cond][Clojure's cond]] function. It receives a list of /expression value/ pairs. Puts the first /value/ whose /expression/ is a true value, if any.  /Expressions/ can be closures (in which case they are executed and their return value used) or other types, which are used as-is. /Values/ are always returned as-is, even if they are closures.

In the example below, the values are scalars. Note that =:else= has no special significance - it's simply evaluated as a string, which represents a booleanly true value. Any other true value (e.g. =:default=, =$true=, etc.) could be used.

#+begin_src elvish :exports both :use github.com/zzamboni/elvish-modules/util
  fn pos-neg-or-zero [n]{
    util:cond [
      { < $n 0 } "negative"
      { > $n 0 } "positive"
      :else      "zero"
    ]
  }

  pos-neg-or-zero 5
  pos-neg-or-zero -1
  pos-neg-or-zero 0
#+end_src

#+results:
: ▶ positive
: ▶ negative
: ▶ zero

